#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-ksvfxWPtdUA5NeMr

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_internal: Refreshing state... [id=i-01fb4a58c2d9fdd24]
aws_instance.composer_external: Refreshing state... [id=i-051f017fb12db6ba5]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3248351]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3730480781]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs94z3BOIakWDK4iuiqrWZYWOK+mhb+JSFBN89VHzna3ayim+Sw8iFVJqDbrVUG40LgTY6QYL6Y5fhkpnvnSNvRnmNMnuCueCoxyzIoEUrjC+dOm4DAsGCc8tSTpoSEKrYdWq3WhevJzvDs1rtyDamNMLvJNWzY7xmBqDSb6i9bW271LzWvr3X9cWbHxC5RHWdnicxcWDqVJAmnAxTOPpK2rfs+0FO2End7WlJepoaiD+fMFPe4KJ7dL8/jSjN8A1x0YzzXMUO0CLndF+ypd6RiKZb4dTNG708lAt15sY/wcMpYVT7Xa+5NV305WhQk8phTuivISa7dNyPdUfrNQZWlCvt+b/DlO19F/XD4gIekOBy9BmsCIFuAZ/BncMQyTW5e5+zdwF278anmNH9fP2Hy7Ba4aEATP4O77ViPIoZxVM1w2XRfrzgL/bvv+aXZ8QDpJacRy9H0ofwRauQ3Og9wmh6XPgWWag0ECVxjIpRqcg4iCtmtW37i6KSqewNUHkpOO0z2fftWCFG3KofQk7rxWDVlCKm8COiFGMcBbnB+AxIMCo5QGBYA0ACRdAZaC4lCQdHVVWWAGAoiTlAKJv1kric+UX2W3S8gBRAgXBdhGsBxAAdtQislJMMaAhRgk15MXKcG3espjBSBLcwbER0Esjbrsln+bAgMYBHkpnKQIkjAt2M0+PGsPkog+nVR8NczBebQ8ABZCBnb4pxwDmjKAIYvoquQ7m4WTND+AlJ6+IlowSNGbfZ2+0hld4h7cl4H/pjpaXnk3RXl3P4OHxr/eGFbeagOgAyK4uFlmIaYA7zECtU2R105HqvkRrWXpMc39lL1AgvObUyi02ORnCPM0Zad3h+JQMJyAqKA/MbDcEPLeXnUwVi42n1imbasPareWFxlE+M3wR/5bw1mUvLN7F7EwokD4Zxzp7I0X34iWYIcBghTkGKIQoIBWvw5XX2NAn1jK75IQHgJMf/8EXAx2ESEAkh08FGCFGYCgzksgxDkGPkaw9Jx0CRCJMGUA4ZwV72EqrxPkISYvKKDAHVh9cCluH4y4RW4JI4JvHTSL6OofAONXRZaxUK9Lt0t5ylKUknMSuNkoGGSbMs/VeenDdYGiICA91bUCfAaddjndDdRBp20ppYtcMlYeFkkNwdr5vNwGZ2ViA1/+oUO95cK/evhvk+O/nEh9WIRvl25iGoATT1H6y1VM9X0+/akAmG6jPKVlFgRbmEfQJ7gAMMfgmhxxcHKNpzfWvzud/qjozsCY6JqiW1dnntmKrbyr0K8bvMEfyvFt21GLylTP+edUz12PxF26iItcTTHNdk95vvuf//rP/wb32kQfWC/ltG2d4vOyYCqGM+goZfa6rJx8GrLrZ7dtKdfHEEMx7bH1fP87uCtA8VqAAtOAS3BxygIcdzKc2+QE3L+dCnBXAs5PgwO4u78Ydvf7i1SMwhTcn2VXKvmGoiQ4v4GgMEkD8Gn/N/jMmZR/4PmPRZQD51yHGAGYlrcKOI6mu3M5+ZV327/nBXbPFSEm5NwF/tIT7I13llWLw5sUZFGGy+itFOkmR/j7Dz6VH0EPs3flBQy61cpAN6223lFeBt3n+9+hEnhuXJzc8qlWE5qtqtioVy//1ghkuGC1BDPIBZDB2lUWFwW/L3W0iwInJT5lgaQwwdWKao/Hb93q89395+83sF+4+883xny5K8VN84gykG7OhlO8u5F7uvM7E7NTJb0Uo+t2Gaf3n9+p/lI9iTQvKHxgqFauv8pLLjDj3kTdvxPz27jtCzjnocIvAXq7dZYCo6+fwTDwKioYzt/7xSltlzSVD0Fzitl3vX9Z8rjzEreFZIPBv5fxwmEaZGlE2TmSP//aVPHlwnKREgUl/V+Zsb6Av4D1K+BycFc1T3wmyyO6ugM/nwG5HadeLra+XMap6rpIaeXK/muUd3+jMPAXcLqkPAHc8m81oPK9ke/ynzuA4+CGpb8lX+vijKQHUM7Lp+JwHm2Ks59dNksvu44voNM+tUPRMkKQ4WrFhwVu1gEXAA788Y9/BPefPzwJfwE/g/vPt5Psl5sZ6JfUxPhwmjDe6fr/8uvvvE38VVc+A3l6iHjvuV837r5PeXbLN1C/Re/MwMX4cELwg2CUs/+j4OvV3MTFN6f57bn4qTkoq8N3HL2sLpvshqTyI7Am3cn7mYFiHJR5GKV0i/OyHkWnzrKrm6AssTnYlb3uDgMCNxSF1QqC7BQUdzdIX8aEL7fol1Xqyx34+edbE35DEF/L+Sa74AoKnG8jhC/4TnOclf30x8eQnwqQ4yRl+CPbKfaLFMW4HLx+oY27SjuLuLyc/ekjrE+PDzz/DZgc90PlfwMAAP//ORGkuwMgAAA=" -> "H4sIAAAAAAAA/9R52XLqSJ73PRH1DvlR/qK644xAC2Djblc0AolVArQCPR1EKpUgodRiKcV2+rzI3MztPN48woQE+GCfU9XLdMRE+cZW5n/LX/7XdDeOKI4oY5wS/AzCnFA/gSmth/4Ru38ATpxHLkxPL1VlqEji1FR7HW1ZrRRfjIXTzI+jZ8DV2B8qP1QY5p7oh8pNds/PkjjzaUkLKYXIC3FE/wA2PsERDPFL1Y98WkObbfUrl5HCKNvglJEiFLt+tH0Gj45P7whKkyk+0joice4yKI42/vaHiuKH+BvjfrynqVTyDKfZcwUABhQWPAOMeKZYrAAAQJZ5a5hTL079M3bXAT6VtMUPA6pZ5jFpBkGn0+mIgnqGXe6EeKn47HXmHbHT6XQ78+5xt5GHQ9LfdKO2j8jgFNqpJKaGyZNJiwZ63+Bw8uh2Z+cDt1u27Mibk9lCSfAs9dWjuiD9J2RP23VNTkSXPbflg3r6FGy2XnuTn9Rloz38pMDW9GRY4rbpqbF83GiLftMfUFTX5yRyJNkfJ3rQIH4SN+YrKtJw23ndBnqn1Tt7p63TyptK2z8aw2PDFne5rrD9xfys7hK8Ofl2/ikbap883kznwbgj5vlwOXfSHfkke1YIJ/t0fzKmfJ5N6T5aijvPmR1O00fenu1gMnbrbc+ArzOJO8inlinz0QI1ZtsDu/XnTivzHdk4P6oGPtpCc95+ek3mU1tZjlGyXaVEh4PBeKUrHj1PHxV3lU4nsrmIda6DO6fG1qNITaeiQZymvp89Cucz+ypqMo+608aUPSTNw+F15u0PfEQdITEmM+piOvpkNdn5LEqixUnXo1XCn+UDwjznLI6tx8hrk8ibpKvtDj+ieB7NOvKxjojQkvTRaevnMyQePgXc0zInS2VhvkKRBofRJNB2vWRnLHjcVEZcK+49ZqMBatTtZnDaTPauklme+8p1F4O+ZU2Tc7x12HbTWvqstpCTaKXVOWxtu3Xtk22d6HKzfGLTjTVFbifm+6tNNGqel5q5GI3ayiqA0fEoSI/m1A+kkdrOzB3PsudW93Rih5vhq+GMOLG5edy4AkRaOmn00NJ05WGdE0+q3ZK53SNa+Z3+dDRWnfNCZg2Bbp6OLObmLy8ghLs4/VOKXQ/SGorD6nt/xy7fbHLt0ue7F58nq96QUw2pWawNZyK3k0kjacmG6B8HRuswDVqLp2hXXz3ieKbOpbrCHsaNp+YYxE7uQv+dssoh9SleFxnhGpYJpN4zqNMwuYT3usgR6z1Ms9IydMkCz+CvV0OnumgOJ711d6ooQ+PlSUBw88SyuMk3+YbT4Bqbx03T2TQhZl0BtTkePbW5Nn/l7k6V2VSXtBv746aJhZbrthtPXJPdQNRwWKEltFDLFdqO89jCPH7i3M1H5Z11V9KMl4nO0onOdTXTHRm+2NOskambq9GclU2t3GNpN+BGuqlJlqT25vZqsWJlQTdH4oolltlT5wq/PKuW2DeDJufwKxaHStPoBbzW90yH10SX1TTbTCYOl4zgYLUzAlnTzMN4TmTRZVevmmWp84AM5oZsaaYsuOzRV9hmspLdDHFJT12sdo6tCnrf2xkB9zpfuDNLslqGpa2wyUmWoS5gX50ai0R0D0mx13i3F8gLwxppLmtFtqnZpiVLmiSzbqic9J3sWYKXGn22ia2kNWdV0WSJoMnySg/o3g5I7IbqtFvaPOqapiyteFc2JVkqae12r/ieB7I6j8TUtuSlbqnK8uxNbDtRTYtEOBK1qamKCjeaKKE71HricbmQz+5uO15ao50VKLxKlOYq8I6aaR6hebRs6UlQeiMN76wz5JNYEZKjMSADc+cJJlnuJ7w6UuzhEe1EC1uJsWSPUOGQYFnJaX6IWbWnhUshPhsL0nBktWVx1srkxGgekAnsu+J0IFNEEl2x2+HS1k54YOlGl56dYCXpNm0oAkqXZ3m8sqxcCdVMkd2kSyzW7o0GGrfqacRVDV7erwIttWWrp0XWRB+4Y9N2+8ZAO+uSCm1bDV3i2rqcQDVoNFzWPShEhrYxbC7PHucsxFfF6oxNaZXZktJY9WVoSJxny8TXDFHVF5qtSOpQj0RBY8lhGZHcsYjpdOlZiyze6Wl7q8+d8CDe44XXQpLGWwE3Q4E8cuZJw+EzARGLWgMr0PqWbHKjrsG7omJSbmlyujWwPH0has55FDjC6jg+d45auDzPzcbJMlXRZS1xbstTS+L62sIdmhaRumSlK1K7OydE1oJYWBmrpSIEh1W/nSG9PV6SVbIMSOLyWm5ynVQNuO5UckXFsgJ94Wq2yXWXptzXdy5RyfaMDTFw+MP4F3jFG6+2cOW53xZMc6XOTa47t5eN78fV8c1H59tE1KKEV3lCdBY1HTmZoGB4MmwOQkk+6hJRsH30DIHYyECCdiZdwxqZWqQe7MhklcFQ0DhNWLJa7IZbTjPVvS7Lfjc8pq4hLlWzvVyxGm8P1C7qt/v6YMQrEp3p9tFQOWusLJYHtZ/tdUIie4BSp5+Y1kDZTxfJwdl5uhUeKRqYe43lZoZhjk17NDC7dAp3FkRnK9TY1QJKDcEwhpxpU2vaG42dgUf0QM7MhTec88ee2bcaZqCqS0NuqouOYPWb0bQnTnTistgS59N5wpq8q86jjqBalr6yn1jVNBumlJz0qHOGA7JX5VFjao00jacnbKu6vnDDeeDxUPBUPVzliFcEW2/zqk04bedRLHGt7k5ll0HcHLNJUzNlTh/Ex2XgcshUl2NBHpuWZrrdtuaclyc3cBdLM2ia3GqyJEpjaXnK/DyaqpG8g/boiHZmY7XTJD2Yj/VIzQz9SUADtYl28l5daOwyGOUqCbj5Qml3/UtO1symNJRU2STaSAtIb25p8iWXs+OPlWIw1Y0XfKQ4jSCpZRRu/WhbVLMkznBaizMn94lbi9PtR85Or6dJuv7CPfI1gau1GjWOu9LYU20saWtdn6zH0lJfdzT1BabRMzxkzxlGKaZZCCO4xelznjEYZpThntuC8NjkufZju92+Uj07KT6UjSvzKJsYk6t83RT1rjacGcOpulY6aqd/rXkdtffPK8tyJ0OpnxQtPnNlYVAchjBymWC+JHH7pn+pG5JSYqd2FGk90yR5uHi5osfc4GQOcRpcm/E74HpD7aWOKapfwWVuaN+kS11NMvS3g0lqbzYdqsba1CYvHqVJ9lyvvz9Z7e1kNRjCcxzBQ1ZcYv2+Cfmeym8WajQOyfd7kz8H8c7/y/UDEhIfsLt24xD6UQZewJ9BlWIY3rtM9d9A1cudWnGNH9cv2Hy7BW4aEAQvoPp9qxFkUEprCS6arqt1F4H/sH3/Mjs+IB3GkU9T9H0ofwRKsQ0ug1yewsLnwCZOwTCEWwzEQg1OgR+Bjq3X3rh6Mcqewc0HwlJHec/lX3U3RnkxlJbiLms1j4ak8iag62EUALzH6QkILMgwiiM3AzByAYm3gMYgO2Uk3t5UZpgCF+IwjoDA3q0VxBfKr7I7BeQAIoSzDOx9WAyggOZRhEkpGGNAPQzC28mzmOB7PcWxXJDEKQX8E8cXRl13i588wwC6bloIJzGCxIszercPL9rd0I+eSxVfDbNw6m9OgHqQggP+KcUgiinAkPrRtuC7mIXDOD2BOCq//CijMEJv9nUHUnd8jXvwUAT+m2p/c+PNs+LufgaPzf9/Z1hxq02ATojg7G6ZejgC+IgRqOdZWi+PVHf8qJ7E5zh1YrqGBKd3p5CiLE8vEKZxTMt3h+yUURwCP4t+omCTE/LeXnk4ka42lyyzjjEA9XvLswQi/Gb4E/ut4dQP39l98KnnR4D7Vxzp4o1X3/A34IABghFIMUQeQG5U+zpcfY0BdWpIvws9eHJx9PtnYGNw8AkBkBzgKQNbTAEEDVYAHk4xcDCChefEG4CIjyMKEE5p9h6m4jpB6mGyRm4E7KExANfi9sGIe+Q20Cf43kETP9r+E2D8qsgiFhoN4X4pjWmMYnJJAncbGYU0L/JcgxU+XBfIMgLisq5l4DPodorpbigPux1DKlzkmrFSLwvrCNYv52VynBSJDXz5pw71lgv/5uG/TY7/ryR1YOa9XbqOIxeUPFnhLzcxtff59KcM4Gjvp3FUZEGwh6kPHYIzAFMMbskRu6VrPL+x/sPp9EdJtYbaVFUk1bg589yUTOldhX7NcY4/lOP7tqPuF6mecS6pnrkdibl2EVe5iqTrnb70Uv3v//yP/wIPylQdGuti2jbK+Lwu6JJmDbtSkb2uK6VPQ3r77HUM6fYYokm6OTFeHn4HDxnIXjOQ4chlQpyVWYBhSsOZPCXg4e1UgLkRME7snkD14WpY9fdXqRh5MXi4yK58LIZ7jGicXn/9WouRxXmKcFbbxXnRQbm3IkxPCS7K8G39dhZ8RCR38TqPfFoW+epVR4bTvY9w9S9v/UHmR0FWi3P6USY8ZOvyceYAKfLWJN5mN/F+lOT02jy8qX7rDHDkJrEf0ULI7dYL7l/sxm5it2mcJ+sIhqX+64Wvb23jjSqjKYbhG9mlUVlfqu7b+a/PyjUUuxiVCGVxVK1U0jxCoXt5hEJeGLvg0/HvCNoLKfvIsh+7GAZcig2iBOCoCCvAMFF8uNbzC+y/8n7+j7yEH5nMw4RcuvFfegq/yxJF98DgPAaJn+Aii1YufvT9h7fKj6CP6bsyD4a9WmWo6kZH7UrrYe/l4XeoCABmkpXp4ble51rtGt9s1K6/6wRSnNF6iClkXEhh/SaL8d3fFzo6WYbDAqaiUSkusVaRzcnkbWp4qT58/v4g8YV5+HxnzJdqIW6WFp4W5xfDI3y4k1vGXlXHtOxork3BbbvIlw+f36n+UitF6lcUPjDUKre/irvOMGXeRD28E/PbuO0rOJfhzikAert1GgNtoF7A0PDWzyhO3/tFWT4LmsqH2Clz57sZrGg9mMsSs4ckx+Dfi7BhblniklE//9p09+XKcpXiuwX935h1v4C/gt0rYFJQrekln05TP9pWwc8XQO7H2vXV1vV1rK0V2aJyY/81yurfKQz8FZSXlIaA2fy9BlS+N3pf/8kGGAbmNP4t+VoPJyQ+gQCfsrJIXzJ3dvGz62bhZbcxEnQ7ZVvqb3wEKa5VHJjhVgMwLmDAH//4R/Dw+cPT/BfwM3j4fP+i8OVuFv0lNQE+lZPeO13/V379nTeiv+nK1xJYAPvec79uVL9PeXHLN1C/Re/CwAT4VCL4QTBK6f9S8O1q7uLim9P89ly87BGK6vAdRy+qS57ckVR+BMa0N30/u0UYu0UeRnG0x2lRj/yyw++pOihKbAoOxcxxwIDAPEJerYIgLYOieof0dVz7co9+UaW+VMHPP9+b8BuC+FbO8+SKK7j2tFd8ZylOirnm46PUTxlIcRhT/JGtjP0sRgEuBuBf6OZu0i4iri+Yf/oI6/PTI8t+AybD/FD5nwAAAP//0sOfl4shAAA="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs8RZTinkFQLBlcRXZXVLEsLnFfTwt9EJKim+eojZ7vbNRTTfBb4qsRXhceqIFxI3IkxUowX0xy/jBTPfGkb+jPM6RPcFU8FRjlmRQIpXOH8aVNwGBaME55akvTQEIXWQ6vVulA9+TnenfpW7kG1MSYX+aYtmx1jMLUGE/1Fa+vt3qXktfXuP66s2PgFyqOs7PC5CwuH0iSBNODimUfS1lW/Z1qKdoJOb2vKy9RQ1MH8+QIed0WT26V5fOnFb3DrDoznGmaodsGWu4J9la50DMUy3w6m6N3pZKBbL7Yxfg4Zy4qnWm2bIczxgSAJjbrENxv1li+ggGsd9/nDsbGtvj959e3k1ZKxChN4TCncFeVF124ble/Z9c1ClaUJ+X7/8uc4XUf/cfmAhKQ7HLwEaQIjWoBn8GdwxzBMbt3q7t/AXbjxq+Vdf1w/A/jtFrhqQBA8g7vvW40gh3JWzXDZmF2sOwv8u+37p9nxAekkpRHL0feh/BFo5TY4D3ubHJaOCZZpDgYJXGEgl2pwDiIK2q5ZfePqpqh4AldHSU46Tvd8+lULUrQpB9eTuPNaNWQJqbwJ6IQYxQBvcX4AEg8KjFIaFADSAJB0BVgKikNB0tVVZYEZCCBOUgok/matJD5TfpXdLiEHECFcFGAbwXJIBWxDKSYnwRgDFmKQXE9epATf6imPFYAszRkQHwWxNOqyW/5tCgxgEOSlcJIiSMK0YDf78Kw9SCL6dFLx1TAH59HyAFgIGdjhn3IMaMoAhiyiq5LvbBZO0vwAUnr6imjBIEVv9nX6Smd0SQ7gvswOb6qj5ZV3U5R39zN4aPzrjWHlrTYAOiCCi5tlFmIK8B4jUNsUee10pJof0VqWHtPcT9kLJDi/OYVCi01+hjBPU3Z6mygOBcMJiAr6EwPLDSHv7VUHY+Vi84ll2rb6oHZreZFBhN8Mf+S/NZxFyTu7dxELIwqEf8aRzt548Y1oCXYYIEhBjiEKAQpo9esA9jUG9Iml/C4J4SHA9PdPwMVgFxECINnBQwFWmAEI6rwEQpxj4GMES89JlwCRCFMGEM5Z8R6m8jpBHmLyggIK3IHVB5cC+MGIW+SWMCL41kGziK7+ATB+VWQZC/W6dLuUpyxFKTkngZuNgkG2KfNcnZc+XBcoCgLSU/ErwGfQaZcT4EAddNqWUrrIJWPlYZHUEKydz8ttcFYmNvDlHzrUWy78q4f/Njn+y4nUh0X4dukmpgE48RSlv1zFVN/n058KgOk2ylNaZkGwhXkEfYILAHMMrskRByfXeHpj/bvT6Y+K7gyMia4punV15pmt2Mq7Mv66wZuP5fi2N6lFZarn/HOq565H4i6txkWupphmu6c83/3Pf/3nf4N7baIPrJdyIrdO8XlZMBXDGXSUMntdVk4+Ddn1s9u2lOuDiaGY9th6vv8d3BWgeC1AgWnAJbg4ZQGOOxnObXIC7t9OBbgrAeenwQHc3V8Mu/v9RSpGYQruz7IrlXxDURKc30lQmKQB+LT/G3zmTMo/8PzHIsqBc65DjABMy1sFHEfT3bmc/Mrb7t/zSrvnihATcm4Vf+mZ9sY7y6rF4U0KsijDZfRWinSTI/z9R6HKj6CH2bvyAgbdamWgm1Zb7ygvg+7z/e9QCTw3Lk5u+VSrCc1WVWzUq5d/awQyXLBaghnkAshg7SqLi4LflzraRYGTEp+yQFKY4GpFtcfjt5b2+e7+8/e73C/c/ecbY77cleKmeUQZSDdnwyne3cg93fmdidmpkl6K0XW7jNP7z+9Uf6meRJoXFD4wVCvXX+UlF5hxb6Lu34n5bdz2BZzz5OGXAL3dOkuB0dfPYBh4FRUM5+/94pS2S5rKh6A5xey7AaAsedx5idtCssHg38t44TANsjSi7BzJn39t9PhyYblIiYKS/q8MYl/AX8D6FXA5uKuaJz6T5RFd3YGfz4DczlwvF1tfLjNXdV2ktHJl/zXKu79RGPgLOF1SngBu+bcaUPneXHj5DyDAcXDD0t+Sr3VxRtIDKIfqU3E4jzbF2c8um6WXXccX0Gmf2qFoGSHIcLXiwwI364ALAAf++Mc/gvvPH56Nv4Cfwf3n23H3y80M9EtqYnw4TRjvdP1/+fV3HjD+qiufgTy9Vrz33K8bd9+nPLvlG6jfondm4GJ8OCH4QTDK2f9R8PVqbuLim9P89lz81ByU1eE7jl5Wl012Q1L5EViT7uT9zEAxDso8jFK6xXlZj6JTZ9nVTVCW2Bzsyl53hwGBG4rCagVBdgqKuxukL2PCl1v0yyr15Q78/POtCb8hiK/lfJNdcAUFzrcRwhd8pznOyn7642PITwXIcZIy/JHtFPtFimJcDl6/0MZdpZ1FXJ7X/vQR1qfHB57/BkyO+6HyvwEAAP//us6ReicgAAA=" -> "H4sIAAAAAAAA/9R52XLqSJ73PRH1DvlR/qK644xAC2Djblc0AolVArQCPR1EKpUgodRiKcV2+rzI3MztPN48woQEuLDPqdPLdMRE+cZW5n/LX/7XdDeOKI4oY5wS/AzCnFA/gSmth/4Ru38ATpxHLkxPL1VlqEji1FR7HW1ZrRRfjIXTzI+jZ8DV2B8qP1QY5p7oh8pNds/PkjjzaUkLKYXIC3FE/wA2PsERDPFL1Y98WkObbfUXLiOFUbbBKSNFKHb9aPsMHh2f3hGUJlN8pHVE4txlUBxt/O0PFcUP8VfG/XhPU6nkGU6z5woADCgseAYY8UyxWAEAgCzz1jCnXpz6Z+yuA3wqaYsfBlSzzGPSDIJOp9MRBfUMu9wJ8VLx2evMO2Kn0+l25t3jbiMPh6S/6UZtH5HBKbRTSUwNkyeTFg30vsHh5NHtzs4Hbrds2ZE3J7OFkuBZ6qtHdUH6T8ietuuanIgue27LB/X0KdhsvfYmP6nLRnv4SYGt6cmwxG3TU2P5uNEW/aY/oKiuz0nkSLI/TvSgQfwkbsxXVKThtvO6DfROq3f2TlunlTeVtn80hseGLe5yXWH7i/lZ3SV4c/Lt/FM21D55vJnOg3FHzPPhcu6kO/JJ9qwQTvbp/mRM+Tyb0n20FHeeMzucpo+8PdvBZOzW254BX2cSd5BPLVPmowVqzLYHduvPnVbmO7JxflQNfLSF5rz99JrMp7ayHKNku0qJDgeD8UpXPHqePiruKp1OZHMR61wHd06NrUeRmk5FgzhNfT97FM5n9lXUZB51p40pe0iah8PrzNsf+Ig6QmJMZtTFdPTJarLzWZREi5OuR6uEP8sHhHnOWRxbj5HXJpE3SVfbHX5E8TyadeRjHRGhJemj09bPZ0g8fAq4p2VOlsrCfIUiDQ6jSaDtesnOWPC4qYy4Vtx7zEYD1KjbzeC0mexdJbM895XrLgZ9y5om53jrsO2mtfRZbSEn0Uqrc9jaduvaJ9s60eVm+cSmG2uK3E7M91ebaNQ8LzVzMRq1lVUAo+NRkB7NqR9II7WdmTueZc+t7unEDjfDV8MZcWJz87hxBYi0dNLooaXpysM6J55UuyVzu0e08jv96WisOueFzBoC3TwdWczNX15ACHdx+qcUux6kNRSH1ff+jl2+2eTapc93Lz5PVr0hpxpSs1gbzkRuJ5NG0pIN0T8OjNZhGrQWT9GuvnrE8UydS3WFPYwbT80xiJ3chf47ZZVD6lO8LjLCNSwTSL1nUKdhcgnvdZEj1nuYZqVl6JIFnsFfr4ZOddEcTnrr7lRRhsbLk4Dg5ollcZNv8g2nwTU2j5ums2lCzLoCanM8empzbf7K3Z0qs6kuaTf2x00TCy3XbTeeuCa7gajhsEJLaKGWK7Qd57GFefzEuZuPyjvrrqQZLxOdpROd62qmOzJ8sadZI1M3V6M5K5taucfSbsCNdFOTLEntze3VYsXKgm6OxBVLLLOnzhV+eVYtsW8GTc7hVywOlabRC3it75kOr4kuq2m2mUwcLhnBwWpnBLKmmYfxnMiiy65eNctS5wEZzA3Z0kxZcNmjr7DNZCW7GeKSnrpY7RxbFfS+tzMC7nW+cGeWZLUMS1thk5MsQ13Avjo1FonoHpJir/FuL5AXhjXSXNaKbFOzTUuWNElm3VA56TvZswQvNfpsE1tJa86qoskSQZPllR7QvR2Q2A3Vabe0edQ1TVla8a5sSrJU0trtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxr/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+pecrJlNaSipskm0kRaQ3tzS5EsuZ8cfK8VgqhsvfkRxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2FY2sCW+Oeahx3JbGn2ljS1ro+WY+lpb7uaOoLTKNneMieM4xSTLMQRnCL0+c8YzDMKMM9twXhsclz7cd2u32lenZSfCj7VuZRNjEmV/m6KepdbTgzhlN1rXTUTv9a8jpq759XluVOhlI/KTp85srCoDgMYeQywXxJ4vZN/1I3JKWETu0o0nqmSfJw8XIFj7mhyRziNLj24ne49YbaSx1TVL9iy9zAvkmXuppk6G8Hk9TebDpUjbWpTV48SpPsuV7fJwgzrMsJXLMhsK1mo+1wyGXa52P6eG7ua+9PXns7ea1grMEQnuMIHrLiouv3jcq37PpqoUbjkHy7f/lzEO/8v1w/ICHxAbtrNw6hH2XgBfwZVCmG4b1bVf8NVL3cqRV3/XH9AuDXW+CmAUHwAqrfthpBBqW0luCiMbtadxH4D9v3L7PjA9JhHPk0Rd+G8kegFNvgMuzlKSwcE2ziFAxDuMVALNTgFPgR6Nh67Y2rF6PsGdwcJSx1lPdc/lV3Y5QXg2sp7rJW82hIKm8Cuh5GAcB7nJ6AwIIMozhyMwAjF5B4C2gMslNG4u1NZYYpcCEO4wgI7N1aQXyh/EV2p4AcQIRwloG9D4shFdA8ijApBWMMqIdBeDt5FhN8r6c4lguSOKWAf+L4wqjrbvGTZxhA100L4SRGkHhxRu/24UW7G/rRc6niF8MsnPqbE6AepOCAf0oxiGIKMKR+tC34LmbhME5PII7KLz/KKIzQm33dgdQdX5MDeCiyw5tqf3PjzbPi7n4Gj83/f2dYcatNgE6I4OxumXo4AviIEajnWVovj1R3/KiexOc4dWK6hgSnd6eQoixPLxCmcUzLt4nslFEcAj+LfqJgkxPy3l55OJGuNpcss44xAPV7y7MEIvxm+BP7teHUD9/ZffCp50eA+1cc6eKNV9/wN+CAAYIRSDFEHkBuVPtlAPslBtSpIf0u9ODJxdHvn4GNwcEnBEBygKcMbDEFEDRYAXg4xcDBCBaeE28AIj6OKEA4pdl7mIrrBKmHyRq5EbCHxgBcC+AHI+6R20Cf4HsHTfxo+0+A8V2RRSw0GsL9UhrTGMXkkgTuNjIKaV7kuQYrfLgukGUExGXxy8Bn0O0UE+BQHnY7hlS4yDVjpV4W1hGsX87L5DgpEhv48k8d6i0X/s3Df50c/19J6sDMe7t0HUcuKHmywl9uYmrv8+lPGcDR3k/jqMiCYA9THzoEZwCmGNySI3ZL13h+Y/2H0+mPkmoNtamqSKpxc+a5KZnSuzL+muP8Yzm+703qfpHqGeeS6pnbkZhrq3GVq0i63ulLL9X//s//+C/woEzVobEuJnKjjM/rgi5p1rArFdnrulL6NKS3z17HkG4PJpqkmxPj5eF38JCB7DUDGY5cJsRZmQUYpjScyVMCHt5OBZgbAePE7glUH66GVX9/lYqRF4OHi+zKx2K4x4jG6fXX91qMLM5ThLPaLs6LNsu9FWF6SnBRhm/rt7PgIyK5i9d55NOyyFevOjKc7n2Eq3956w8yPwqyWpzTjzLhIVuXDzgHSJG3JvE2u4n3oySn1+bhTfVbZ4AjN4n9iBZC3jdvHGYFzoFNVhCgw6Img1/32/i452uF9O+3bDfd2zTOk3UEw9LIq1esbw3ojSqjKYbhG9mlm1lfSvMbSNf36RqKXYxKGLM4qlYqaR6h0L28ZiEvjF3w6fh3RPaFlH1k2Y+tDgMuFQlRAnBUxB5gmCg+XIv+5W6+8xD/jzypH5nMw4Rc+vpfe1O/SyVFi8HgPAaJn+Ai1VYuzvbtF7zKj6CP6bteAAx7tcpQ1Y2O2pXWw97Lw+9QESXMJCtzyHO9zrXaNb7ZqF1/1wmkOKP1EFPIuJDC+k0W47u/L3R0sgyHBUxFN1NcYq0im5PJ2/zxUn34/O2R5Avz8PnOmC/VQtwsLdwxzi+GR/hwJ7cM0KqOadn2XDuH23aRVB8+v1P9pVaK1K8ofGCoVW5/FXedYcq8iXp4J+a3cdtXcC5jolMA9HbrNAbaQL2AoeGtn1GcvveLssYWNJUPsVMm2HfTWtGfMJclZg9JjsG/F2HD3FLJJe1+/t6c+OXKcpXiuwX935iav4C/gt0rYFJQrekln05TP9pWwc8XQO4H5PXV1vV1QK4V2aJyY/8eZfXvFAb+CspLSkPAbP5eAyrfGuKv/60DDANzGv+WfK2HExKfQIBPWVnJL5k7u/jZdbPwstusCbqdsnf1Nz6CFNcqDsxwqwEYFzDgj3/8I3j4/OGN/wv4GTx8vn+b+HI3sP6amgCfynHwna7/K7/+xmvT33TlawksgH3vub9sVL9NeXHLN1C/Ru/CwAT4VCL4QTBK6f9S8O1q7uLiq9P89ly87BGK6vANRy+qS57ckVR+BMa0N30/4EUYu0UeRnG0x2lRj/xyDOipOihKbAoOxWBywIDAPEJerYIgLYOieof0dab7co9+UaW+VMHPP9+b8BuC+FbO8+SKK7g2vld8ZylOiuHn48vVTxlIcRhT/JGtjP0sRgEupuRf6eZu0i4irm+hf/oI6/PTI8t+BSbD/FD5nwAAAP//gR822tQhAAA="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 will be created
  + resource "aws_spot_fleet_request" "workers_external_x86" {
      + allocation_strategy                 = "lowestPrice"
      + client_token                        = (known after apply)
      + excess_capacity_termination_policy  = "Default"
      + fleet_type                          = "maintain"
      + iam_fleet_role                      = "arn:aws:iam::933752197999:role/imagebuilder_spot_fleet_role_staging"
      + id                                  = (known after apply)
      + instance_interruption_behaviour     = "terminate"
      + instance_pools_to_use_count         = 1
      + load_balancers                      = (known after apply)
      + replace_unhealthy_instances         = false
      + spot_request_state                  = (known after apply)
      + tags                                = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "External worker fleet - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + target_capacity                     = 1
      + target_group_arns                   = (known after apply)
      + terminate_instances_with_expiration = true
      + wait_for_fulfillment                = false

      + launch_template_config {
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 will be created
  + resource "aws_spot_fleet_request" "workers_internal_x86" {
      + allocation_strategy                 = "lowestPrice"
      + client_token                        = (known after apply)
      + excess_capacity_termination_policy  = "Default"
      + fleet_type                          = "maintain"
      + iam_fleet_role                      = "arn:aws:iam::933752197999:role/imagebuilder_spot_fleet_role_staging"
      + id                                  = (known after apply)
      + instance_interruption_behaviour     = "terminate"
      + instance_pools_to_use_count         = 1
      + load_balancers                      = (known after apply)
      + replace_unhealthy_instances         = false
      + spot_request_state                  = (known after apply)
      + tags                                = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder internal worker fleet - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + target_capacity                     = 0
      + target_group_arns                   = (known after apply)
      + terminate_instances_with_expiration = true
      + wait_for_fulfillment                = false

      + launch_template_config {
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*